# Prot_DisableModule

## Description
Disables the module, if it is currently enabled.

```pascal
PROCEDURE Prot_DisableModule(module : LONGINT);
```

```python
def vs.Prot_DisableModule(module):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|module|LONGINT|   |

## Examples
```pascal
Prot_DisableModule(1);
```
```python
import vs

# Disables the module, if it is currently enabled.
module = 1

vs.Prot_DisableModule(module)
```

## Version
Availability: from Vectorworks 2023

## Category
* Protection